benchmark/benchmark-result-2025-12-26/sleep_0ms_no_special_vars/keep-alive/hunchentoot_default.log
hunchentoot_default.log
HUNCHENTOOT	1.3.1

LISP-IMPLEMENTATION-TYPE   	SBCL                               
LISP-IMPLEMENTATION-VERSION	2.2.9.debian                       
MACHINE-TYPE               	X86-64                             
MACHINE-VERSION            	13th Gen Intel(R) Core(TM) i7-1360P
SOFTWARE-TYPE              	Linux                              
SOFTWARE-VERSION           	5.15.153.1-microsoft-standard-WSL2 
*handler-sleep-seconds*	0.001

# -t 4 -c 100 -d 10 http://localhost:4242/yo 
Running 10s test @ http://localhost:4242/yo
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.25ms   16.18ms 295.22ms   96.31%
    Req/Sec    15.59k    13.87k   62.77k    85.42%
  611054 requests in 10.06s, 85.66MB read
Requests/sec:  60744.32
Transfer/sec:      8.52MB

# -t 4 -c 10 -d 10 http://localhost:4242/yo 
Running 10s test @ http://localhost:4242/yo
  4 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   517.03us  555.57us  18.72ms   98.57%
    Req/Sec     3.94k   426.03     4.85k    74.19%
  158142 requests in 10.10s, 22.17MB read
Requests/sec:  15658.25
Transfer/sec:      2.20MB

# -t 16 -c 400 -d 10 http://localhost:4242/yo 
Running 10s test @ http://localhost:4242/yo
  16 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    22.14ms   91.28ms   1.78s    94.73%
    Req/Sec     2.84k     3.33k   17.48k    83.67%
  370653 requests in 10.09s, 52.58MB read
  Socket errors: connect 0, read 1631, write 1929, timeout 24
  Non-2xx or 3xx responses: 3561
Requests/sec:  36724.02
Transfer/sec:      5.21MB